#include "bsdata.h"
#include "area.h"
#include "creature.h"
#include "game.h"
#include "item.h"
#include "message.h"
#include "spell.h"
#include "stringbuilder.h"
#include "stringlocale.h"

BSENUM(namen) = {
	"Безимянный", "Безимянная", "Менелай", "Тия", "Ахилл", "Хатшепсут",
	"Одиссей", "Пенелопа", "Нестор", "Кассандра", "Диомед", "Андромаха",
	"Аякс", "Гекуба", "Приам", "Ифигения", "Гектор", "Электра",
	"Парис", "Навсикая", "Эней", "Клитемнестра", "Саргон", "Елена",
	"Нарам-Суэн", "Брисеида", "Шульги", "Хрисеида", "Ур-Намму", "Креуса",
	"Хаммурапи", "Деидамия", "Зимри-Лим", "Лаодика", "Ишби-Эрра", "Поликсена",
	"Лугальзагеси", "Кассиепея", "Гильгамеш", "Медея", "Энмеркар", "Федра",
	"Лугальбанда", "Антигона", "Син-Мубаллит", "Иокаста", "Рим-Син", "Алкмена",
	"Идрими", "Аталанта", "Тудхалия", "Арсиноя", "Суппилулиума", "Дидона",
	"Мурсили", "Ниоба", "Хаттусили", "Ариадна", "Арнуванда", "Гермиона",
	"Пиямарду", "Исмена", "Куригальзу", "Тиро", "Кадашман-Энлиль", "Европа",
	"Бурна-Буриаш", "Калипсо", "Ашшур-убаллит", "Семирамида", "Тукульти-Нинурта", "Астарта",
	"Энлиль-Насир", "Инанна", "Ашшур-надин-аххе", "Иштар", "Киккули", "Эрешкигаль",
	"Пентаур", "Тефнут", "Хуфу", "Нейт", "Хефрен", "Бастет",
	"Менкаура", "Сехмет", "Джосер", "Мут", "Снофру", "Исида",
	"Тутмос", "Нефтида", "Аменхотеп", "Маат", "Эхнатон", "Хатор",
	"Тутанхамон", "Меритамон", "Хоремхеб", "Анхесенамон", "Рамсес", "Кийя",
	"Сети", "Нефертари", "Мернептах", "Сатра", "Сенусерт", "Тадукипа",
	"Аменемхет", "Туйя", "Яхмос", "Бентрешит", "Минос", "Феано",
	"Радамант", "Леда", "Идоменей", "Ипполита", "Дедал", "Пасифая",
	"Талос", "Эвридика", "Кадм", "Галатея", "Пелоп", "Ианта",
	"Атрей", "Меланта", "Тиест", "Филомела", "Орест", "Прокна",
	"Алкиной", "Арета", "Беллерофонт", "Аэгле", "Диводас", "Меланиппа",
	"Судас", "Эрифила", "Троян", "Лисимаха", "Рез", "Ипподамия",
	"Котис", "Мегара", "Ситалк", "Дирка", "Ариант", "Хиона",
	"Атей", "Канаке", "Бренн", "Фемисто", "Амбиорикс", "Пирра",
	"Луг", "Кирка", "Кухулин", "Энида", "Конхобар", "Дейрдре",
	"Финн", "Скатах", "Нуада", "Маха", "Бран", "Этайн",
	"Таранис", "Боудикка", "Тевтат", "Рианнон", "Эвмел", "Аойфе",
	"Анхур", "Медб", "Имхотеп", "Эмер", "Хапу", "Бекума",
	"Камос", "Финдабайр", "Псамметих", "Несса", "Интеф", "Кайренн",
	"Ментухотеп", "Морриган", "Уна", "Бригита", "Хор", "Дану",
	"Птахмос", "Эпона", "Ахмос", "Фрейя", "Нахт", "Сиф",
	"Бата", "Идунн", "Пентевер", "Гевьон", "Хаэмуас", "Сольвейг",
	"Каваб", "Астрид", "Рахотеп", "Гудрун", "Анен", "Хервёр",
	"Птаххотеп", "Тора", "Мерир", "Лагерта", "Джедхор", "Альвдис",
	"Сабни", "Рагнхильд", "Нехси", "Ингрид", "Херуэф", "Сигрун"
};
BSENUM(actionn) = {
	"Ничего не делать.",
	"Выставив [%-Weapon] набросится на врага.",
	"Атаковать ближайшего врага.",
	"Стрелять по врагу.",
	"Метать [%-Weapon] по врагу.",
	"Бежать отсюда прочь.",
	"Поохотиться в округе.",
	"Ухаживать за больными.",
	"Перевязать свежие раны.",
	"Ремонтировать экипировку.",
	"Искать травы и ягоды.",
	"Отдыхать всю ночь.",
	"Запомнить заклинания.",
	"Подготовить заклинания [%1i] уровня.",
	"Подготовить заклинания [%1i] уровня (свободно %2i).",
	"Сделать привал.",
};
assert_enum(bsenum<actionn>::names, MakeCamp)
BSENUM(messagen) = {
	"Приключения в мире Темного Солнца",
	"%Player набросился на врага.",
	"%Player критически промазал%а.",
	"%Player промазал%а.",
	"%Player попал%а.",
	"%Player критически попал%а.",
	"%Player получил%а [%Number] урона.",
	"%Player получил%а [%Number] урона и упал%а.",
	"%Player потерял%а равновесие.",
	"%Player голодает.",
	"Несколько ранений у %Player зажили.",
	"%Player почуствовал%а себя значительно лучше.",
	"%Player добыл%а немного провизии.",
	"%Player подстрелил%а съедобную дичь.",
	"%Player починил%а %Item.",
	"%Item разлетелось на части.",
	"%Item треснуло.",
	"%Player открыл%а книгу заклинаний и начал%а изучать доступные заклятия и формулы.",
	"Вечером вы нашли удачное место для привала.",
	"Вы нашли небольшую пещеру, где разожгли костер и решили обустроить лагерь.",
	"Вы нашли неплохое место для привала и разожгли костер.",
	"На следующий день вы двинулись далее.",
	"Ночью %Player услышал подозрительный шорох недалеко от лагеря.",
	"Подумал%а %Player",
	"Сказал%а %Player",
	"Прокричал%а %Player",
	"Кто здесь?",
	"(осталось %1i)",
	"Подготовить какое заклинание %1i уровня?",
	"Что будет делать %Player?",
}; assert_enum(bsenum<messagen>::names, AskWhatToDo)
BSENUM(commandn) = {
	"Отменить", "Продолжить", "Изменить игрока", "Очистить все", "Подтвердить",
	"Персонаж", "Предметы", "Бой",
}; assert_enum(bsenum<commandn>::names, PageCombatants)
BSENUM(classn) = {
	"Воин", "Клерик", "Вор", "Маг",
	"Человек", "Хоббит", "Гном", "Эльф"
}; assert_enum(bsenum<classn>::names, Elf)
BSENUM(itemn) = {
	"Кулаки", "Когти",
	"Кинжал", "Ручной топор", "Метательное копьё", "Копьё", "Посох", "Булава",
	"Короткий меч", "Меч", "Двуручный меч",
	"Длинный лук", "Короткий лук", "Арбалет",
	"Кожанка", "Кольчуга", "Латы", "Щит",
	"Сухпаек", "Сырое мясо", "Грибы", "Трава", "Ягода",
	"Стрела", "Болт",
	"Агат", "Малахит", "Лазурит", "Аметист", "Цитрин",
	"Гранат", "Перидот", "Аквамарин", "Турмалин", "Топаз",
	"Опал", "Танзанит", "Шпинель", "Александрит", "Параиба",
	"Сапфир", "Изумруд", "Рубин", "Алмаз", "Розовый алмаз",
}; assert_enum(bsenum<itemn>::names, PinkDiamond)
BSENUM(arean) = {
	"Где-то в дикой местности",
	"Равнина", "Пески", "Пустошь", "Холмы", "Горы", "Лес",
	"Пещера", "Подземелье", "Руины",
	"Сад", "Храм", "Гостиница", "Таверна", "Дворец",
	"Поселение", "Деревня", "Город", "Город-Государство",
}; assert_enum(bsenum<arean>::names, LargeTown)
BSINFO(arean) = {
	"Вы находились в неизвестном для вас месте. Вокруг вас был песок, уходящий вдаль до горизонта. Далеко на горизонте были видный горы.",
	"Вокруг вас были бесконечный песок, время от времени пересекающийся песчаными дюнами, уходящий до горизонта. Жара стоит невыносимая, песок хрустит под ногами, а падальщики в небе начинают кружить ниже. Вы двигались вперед.",
	"Дюны",
	"Солнце висит в зените, словно расплавленный медный диск, и воздух над пустошью дрожит от жары. Песок под ногами — мелкий, почти как пепел, и каждый шаг поднимает тонкую пыльную завесу, которая оседает на потной коже и скрипит между зубами. Ветер иногда приносит горячие порывы, несущие запах палёного камня и чего-то гнилостного — возможно, давно высохших костей.",
	"Холмы",
	"Горы",
	"Вы оказались в огромном зале с высоким сводом, который когда-то был главной улицей города. Колонны из чёрного базальта, украшенные выцветшими рельефами крылатых быков и звёздных духов, уходили вверх и терялись в темноте. Потолок был частично обрушен: сквозь трещины пробивались тонкие лучи света, в которых танцевала золотистая пыль. Под ногами — мозаика из лазурита и бирюзы, изображающая карту ночного неба, но многие плитки были выбиты или растрескались.",
};
BSENUM(abilityn) = {
	"Уровень",
	"Сила", "Ловкость", "Телосложение", "Интеллект", "Мудрость", "Харизма",
	"Ближний бой", "Стрельба", "Метание",
	"Урон ближнего боя", "Урон стрельбы", "Урон метания",
	"КБ", "Количество атак", "Инициатива", "Лояльность", "Мораль", "Движение", "Хиты",
	"Спасение от смерти", "Спасение от палочки", "Спасение от паралича", "Спасение от дыхания", "Спасение от магии",
	"Лазанье", "Найти ловушки", "Слышать звуки", "Двигаться тихо", "Вскрывать замки", "Выслеживание",
	"Поиск пути", "Ремонт экипировки", "Обработка ранений", "Охота", "Собирание еды", "Уход за болезнью", "Создание оборудование", "Знания легенд",
	"Двойная атака (в день)",
}; assert_enum(bsenum<abilityn>::names, DoubleAttackPerDay)
BSENUM(spelln) = {
	"Исцелить легкую рану", "Нанести легкую рану", "Обнаружить зло", "Обнаружить магию", "Свет", "Тьма",
	"Защита от зла", "Очистить еду и воду", "Убрать страх", "Вызвать страх", "Сопротивление холоду",
}; assert_enum(bsenum<spelln>::names, LastSpell)