/*
	Copyright 2026 by Pavel Chistyakov

	Licensed under the Apache License, Version 2.0 (the "License");
	you may not use this file except in compliance with the License.
	You may obtain a copy of the License at

	http://www.apache.org/licenses/LICENSE-2.0

	Unless required by applicable law or agreed to in writing, software
	distributed under the License is distributed on an "AS IS" BASIS,
	WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
	See the License for the specific language governing permissions and
	limitations under the License.77
*/

#include "area.h"
#include "creature.h"
#include "game.h"
#include "message.h"
#include "stringbuilder.h"
#include "stringset.h"
#include "wise.h"

const char* command_names[LastCommand + 1] = {
	"Отменить", "Продолжить",
	"Персонаж", "Навыки", "Предметы", "Сражение"
};

const char* creature_names[LastCreature + 1] = {
	"Крестьянин",
	"Новичек", "Страж", "Патрульный", "Лидер", "Капитан"
};

const char* message_names[LastMessage + 1] = {
	"Mouse guard 0.1", "Да", "Нет",
	"Какое положение занимает мышь в гвардии?",
	"Откуда вы родом?",
	"Какой навык вы выучили дома?",
	"Какую особенность вы вынесли из дома?",
	"Кем вы были до службы в мышинной гвардии?",
	"Кем был ваш отец (или мать)?",
	"Кто вы в общении с другими мышами?",
	"Кем был ваш Мастер-ремесленник, у которого вы служили подмастерьем?",
	"Чему учил вас ваш старший наставник в гвардии?",
	"Какая ваша специализация в отряде?",
	"Вы будете готовиться к зиме, даже если прямо сейчас в этом нет необходимости?",
	"Когда вступаете в конфронтацию вы готовы стоять и драться или будете бежать и прятаться?",
	"Вы боитесь сов, ласок или волков?",
	"Выбирайте особенность",
};

const char* area_names[LastArea + 1] = {
	"Древоград", "Меднолесье", "Моховяз", "Плющи", "Локхэйвен", "Порт-Сумах", "Сланцевая нора", "Подьельник",
};

const char* skill_names[LastSkill + 1] = {
	"Натура", "Воля", "Здоровье", "Ресурсы", "Связи",
	"Администратор", "Пчеловод", "Архивариус", "Оружейник", "Пекарь",
	"Лодочник", "Пивовар", "Плотник", "Картограф", "Повар",
	"Боец", "Стекольщик", "Торгаш", "Жнец", "Целитель",
	"Охотник", "Энтомолог", "Наставник", "Рабочий", "Знаток",
	"Манипулятор", "Милитарист", "Мельник", "Оратор", "Следопыт",
	"Дипломат", "Гончар", "Учёный", "Разведчик", "Кузнец",
	"Каменщик", "Выживальщик", "Погодознавец", "Ткач",
};

const char* trait_names[LastTrait+1] = {
	"Бдительный", "Большая лапа", "Сварливый", "Телохранитель", "Смелый",
	"Храбрый", "Спокойный", "Умный", "Сострадательный", "Хитрый",
	"Любопытный", "Чуткий слух", "Защитник", "Решительный", "Целеустремлённый",
	"Рано встающий", "Экстраверт", "Толстый", "Пугливый", "Бесстрашный",
	"Пылкий", "Щедрый", "Грациозный", "Честь стражника", "Трудолюбивый",
	"Независимый", "Невинный", "Любознательный", "Закалённый", "Лидер",
	"Длинный хвост", "Заблудившийся", "Природное чутьё", "Проворный", "Ночной",
	"Старый мех", "Открытый", "Сообразительный", "Тихий", "Рациональный",
	"В шрамах", "Остроглазый", "Острые зубы", "Низкорослый", "Скептичный",
	"Худой", "Уверенные лапы", "Стоический", "Упрямый", "Подозрительный",
	"Высокий", "Вдумчивый", "Крепкий", "Чувство погоды", "Мудрый",
	"Волчий нюх", "Молодой"
};

const char* wise_names[LastWise+1] = {
	"Знания Древограда", "Знания Меднолесья", "Знания Моховяза", "Знания Плюща", "Знания Локхавена", "Знания Порт-Сумаха", "Знания Сланцевой норы", "Знания Подъельника",
	"Знания леса", "Знания озер", "Знания ручьев", "Знания высокой травы", "Знания болот", "Знания грязи", "Знания колючек", "Знания листьев", "Знания каменистой местности", "Знания побережья", "Знания открытой местности",
	"Знания темных пещер",
};

stringset stringset_data[] = {
	DSTEXT(message_names),
	{}};
